{"data":{"site":{"siteMetadata":{"title":"Serge van den Oever's weblog","author":"Serge van den Oever"}},"markdownRemark":{"id":"8fc97c55-7177-5dee-ba70-4f99e87fa826","html":"<p>There is always that first blog post when you start a weblog. Well, this is THAT post.\nI have been blogging (on and off) for years. I started on <a href=\"http://weblogs.asp.net/soever\">weblogs.asp.net</a> in 2003, a hosting platform provided by Microsoft - also hosting the big Microsoft names like <a href=\"https://weblogs.asp.net/scottgu\">Scott Guthrie</a>. But the platform is ageing, and writing blog posts in the web interface is not the best experience.</p>\n<p>I tried <a href=\"https://medium.com/@svdoever\">blog posts on Medium</a>, and hated the editing experience, especially with code… everything must be gist on Github, because code formatting within Medium is terrible. But including long gists results in a really slow editing experience. But the most important reason to leave Medium is a post on an e-mail list by <a href=\"http://joelhooks.com\">Joel Hooks</a> of <a href=\"https://egghead.io/\">EggHead.io</a> who wrote in a post called <a href=\"https://www.getdrip.com/deliveries/fseddnphjsr6souec1vf?__s=dx85yvypxe528hsunssi\">building YOUR brand as a developer…</a>:</p>\n<blockquote>\n<p>Giving Medium words in exchange for exposure is hardly a fair trade.\nIf I write something, I want it to be a “Joel” post, not a “Medium” post.\nNobody ever says “oh, hey, did you see that article Joel wrote on Medium?” They say, “Did you see that Medium post?”</p>\n</blockquote>\n<p>and </p>\n<blockquote>\n<p>These are your deeply-held opinions that took years for you to develop.\nYou own those thoughts, so you should own where you air them.\nWe — and I mean us, the software developers — need to make a stand and bring back the personal blog.\nWe need to own our work, our thoughts, our tutorials, our content.\nAnd as developers, we’re uniquely positioned to do it.</p>\n</blockquote>\n<p>So this the start of my first self-owned blogging platform. I’m using <a href=\"https://www.gatsbyjs.org\">Gatsby</a>, and “stole” the initial code from Dan Abramov’s weblog <a href=\"https://overreacted.io\">overreacted.io</a>. Thanks Dan!</p>\n<p>Joel Hooks also created a great <a href=\"https://github.com/eggheadio/gatsby-starter-egghead-blog\">Gatsby-based weblog starter</a>,  I will definitely steal some of the ideas from his code-base - I love the MDX idea!</p>\n<p>So let’s get started with blogging! It has been a while…</p>","timeToRead":2,"frontmatter":{"title":"Serge's first blog post!?","date":"January 18, 2019","spoiler":"That mandatory first blog post on my own \"blogging platform\". After blogging for years on http://weblogs.asp.net/soever and some endeavors with the Medium blogging platform."},"fields":{"slug":"/first-blogpost/"}}},"pageContext":{"slug":"/first-blogpost/","previous":{"fields":{"slug":"/weblog-deployment-to-static-azure-website/"},"frontmatter":{"title":"Weblog deployment to a static Microsoft Azure website"}},"next":{"fields":{"slug":"/_install-sitecore-91/"},"frontmatter":{"title":"Install Sitecore 9.1 in a breeze"}}}}